cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/versions"
tap "eddieantonio/eddieantonio"

brew "httpie"
brew "imgcat"
brew "jq"
brew "mas"
brew "tmux"
brew "watch"

cask "colorpicker-skalacolor"
cask "dash"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "ngrok"
cask "notion"
cask "sizeup"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"

# Propel
cask "java8"

mas "1Password", id: 443987910
mas "Paprika Recipe Manager", id: 451907568 
mas "Slack", id: 803453959
