cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/versions"

# To install useful key bindings and fuzzy completion:
# $(brew --prefix)/opt/fzf/install
brew "fzf"
brew "git"
brew "httpie"
brew "mas"
brew "node"
brew "tmux"
brew "trash"
brew "watch"
brew "yarn"
brew "youtube-dl"

# Propel
brew "imagemagick"
brew "mrbfrank/android-sdk-24/android-sdk"

cask "colorpicker-skalacolor"
cask "dash"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "skitch"
cask "slack"
cask "sizeup"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"

# Propel
cask "java8"

mas "1Password", id: 443987910
mas "Paprika Recipe Manager", id: 451907568 
mas "Slack", id: 803453959
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
